In [123]:
import pandas as pd
import numpy as np

In [125]:
mylist = [5.4, 6.1, 1.7, 99.8]
myarray = np.array(mylist)

In [126]:
myseries1 = pd.Series(data=mylist)
print(myseries1)
myseries2 = pd.Series(data=mylist)
print(myseries2)

0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64
0     5.4
1     6.1
2     1.7
3    99.8
dtype: float64

In [127]:
print(myseries1[2])

1.7

In [131]:
mylabels = ['first','second','third','fourth']
myseries3 = pd.Series(data=mylist,index=mylabels)
print(myseries3)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [132]:
myseries4 = pd.Series(mylist,mylabels)
print(myseries4)

first      5.4
second     6.1
third      1.7
fourth    99.8
dtype: float64

In [133]:
print(myseries4['second'])

6.1

In [136]:
myseries5 = pd.Series([5.1, 1.1, 8.8, 1.6],['first','third','fourth','fifth'])
print(myseries5)
print('')
print(myseries5+myseries4)

first     5.1
third     1.1
fourth    8.8
fifth     1.6
dtype: float64

fifth       NaN
first      10.5
fourth    108.6
second      NaN
third       2.8
dtype: float64

fifth       NaN
first      10.5
fourth    108.6
second      NaN
third       2.8
dtype: float64

In [145]:
df1 = pd.concat([myseries4,myseries5],axis=1,sort=False)
df1

           0    1
first    5.4  5.1
second   6.1  NaN
third    1.7  1.1
fourth  99.8  8.8
fifth    NaN  1.6

In [140]:
df2 = pd.DataFrame(np.random.randn(5,5))
df2

          0         1         2         3         4
0 -1.093398  2.771459 -0.172639 -1.725099 -0.318862
1  0.178831  0.409142 -0.086513 -0.032143  1.365963
2 -0.371197 -1.856800  1.321501  0.956461 -0.276645
3  1.318729  0.266365 -0.160457  0.670202 -0.570804
4  0.615751 -1.528357  1.501440 -0.518743  1.286876

In [148]:
df3 = pd.DataFrame(np.random.randn(5,5),index=['first row','second row','third row','fourth row','fifth row'],
                   columns=['first col','second col','third col','fourth col','fifth col'])
df3

            first col  second col  third col  fourth col  fifth col
first row    0.251330    0.174611   1.389981    0.130487  -0.400641
second row   0.069985   -0.190280  -2.100116   -0.333476  -1.417100
third row    0.589939   -1.357540   2.353814    0.193752  -0.056476
fourth row  -0.837597    0.496171  -0.651543   -0.455849   0.465278
fifth row   -0.079780    1.427187   0.747277    0.455634  -1.206779

In [151]:
print(df3['second col'])
print('')
df3[['third col', 'first col']]

first row     0.174611
second row   -0.190280
third row    -1.357540
fourth row    0.496171
fifth row     1.427187
Name: second col, dtype: float64

            third col  first col
first row    1.389981   0.251330
second row  -2.100116   0.069985
third row    2.353814   0.589939
fourth row  -0.651543  -0.837597
fifth row    0.747277  -0.079780

In [2]:
import pandas as pd

In [5]:
s1 = pd.Series([1,2,3,4,5])
s1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [7]:
type(s1)

pandas.core.series.Series

In [9]:
l1 = [1,2,3,4,5]
l1

[1, 2, 3, 4, 5]

In [10]:
s2 = pd.Series(l1)
s2

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [12]:
s3 = pd.Series([1,2,3,4,5], index=['a','b','c','d','e'])
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
s4 = pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5}, index=['d','b','f','e','c','a'])
s4

d    4.0
b    2.0
f    NaN
e    5.0
c    3.0
a    1.0
dtype: float64

In [26]:
s5 = pd.Series({'a':1,'b':2,'c':3,'d':4,'e':5})
s5

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [27]:
s5 + 5

a     6
b     7
c     8
d     9
e    10
dtype: int64

In [28]:
s6 = pd.Series([1,2,3,4,5,6,7,8,9])
s6[3]

4

In [30]:
s7 = pd.Series([1,2,3,4,5,6,7,8,9])
s7[-3:]

6    7
7    8
8    9
dtype: int64

In [36]:
s6, s6, s6+s7, s6 - s7

(0    1
 1    2
 2    3
 3    4
 4    5
 5    6
 6    7
 7    8
 8    9
 dtype: int64,
 0    1
 1    2
 2    3
 3    4
 4    5
 5    6
 6    7
 7    8
 8    9
 dtype: int64,
 0     2
 1     4
 2     6
 3     8
 4    10
 5    12
 6    14
 7    16
 8    18
 dtype: int64,
 0    0
 1    0
 2    0
 3    0
 4    0
 5    0
 6    0
 7    0
 8    0
 dtype: int64)

In [37]:
s7 = pd.Series([1,2,3,4,5,6,7,8,9])
s7[:4]

0    1
1    2
2    3
3    4
dtype: int64

In [44]:
pd.DataFrame({"Name":['Bob','Sam','Anne'],"Marks":[75,25,92]})

   Name  Marks
0   Bob     75
1   Sam     25
2  Anne     92

In [47]:
df1 = pd.DataFrame({"Name":['Bob','Sam','Anne','Matt'],"Marks":[75,25,92,99]})
df1

   Name  Marks
0   Bob     75
1   Sam     25
2  Anne     92
3  Matt     99

In [57]:
iris = pd.read_csv('iris.csv')

In [58]:
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [60]:
iris.tail()

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

In [62]:
iris.shape

(150, 5)

In [65]:
iris.describe()

       Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
count    150.000000   150.000000    150.000000   150.000000
mean       5.843333     3.057333      3.758000     1.199333
std        0.828066     0.435866      1.765298     0.762238
min        4.300000     2.000000      1.000000     0.100000
25%        5.100000     2.800000      1.600000     0.300000
50%        5.800000     3.000000      4.350000     1.300000
75%        6.400000     3.300000      5.100000     1.800000
max        7.900000     4.400000      6.900000     2.500000

In [72]:
iris.head()

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width Species
0           5.1          3.5           1.4          0.2  setosa
1           4.9          3.0           1.4          0.2  setosa
2           4.7          3.2           1.3          0.2  setosa
3           4.6          3.1           1.5          0.2  setosa
4           5.0          3.6           1.4          0.2  setosa

In [74]:
iris.iloc[0:3,0:2]

   Sepal.Length  Sepal.Width
0           5.1          3.5
1           4.9          3.0
2           4.7          3.2

In [77]:
iris.loc[0:3,("Sepal.Length","Petal.Length")]

   Sepal.Length  Petal.Length
0           5.1           1.4
1           4.9           1.4
2           4.7           1.3
3           4.6           1.5

In [79]:
iris.drop("Sepal.Length",axis=1)

     Sepal.Width  Petal.Length  Petal.Width    Species
0            3.5           1.4          0.2     setosa
1            3.0           1.4          0.2     setosa
2            3.2           1.3          0.2     setosa
3            3.1           1.5          0.2     setosa
4            3.6           1.4          0.2     setosa
..           ...           ...          ...        ...
145          3.0           5.2          2.3  virginica
146          2.5           5.0          1.9  virginica
147          3.0           5.2          2.0  virginica
148          3.4           5.4          2.3  virginica
149          3.0           5.1          1.8  virginica

[150 rows x 4 columns]

In [87]:
iris.drop([1,2,3],axis=0)

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
0             5.1          3.5           1.4          0.2     setosa
4             5.0          3.6           1.4          0.2     setosa
5             5.4          3.9           1.7          0.4     setosa
6             4.6          3.4           1.4          0.3     setosa
7             5.0          3.4           1.5          0.2     setosa
..            ...          ...           ...          ...        ...
145           6.7          3.0           5.2          2.3  virginica
146           6.3          2.5           5.0          1.9  virginica
147           6.5          3.0           5.2          2.0  virginica
148           6.2          3.4           5.4          2.3  virginica
149           5.9          3.0           5.1          1.8  virginica

[147 rows x 5 columns]

In [89]:
iris.mean()

Sepal.Length    5.843333
Sepal.Width     3.057333
Petal.Length    3.758000
Petal.Width     1.199333
dtype: float64

In [91]:
iris.median()

Sepal.Length    5.80
Sepal.Width     3.00
Petal.Length    4.35
Petal.Width     1.30
dtype: float64

In [93]:
iris.min()

Sepal.Length       4.3
Sepal.Width          2
Petal.Length         1
Petal.Width        0.1
Species         setosa
dtype: object

In [94]:
iris.max()

Sepal.Length          7.9
Sepal.Width           4.4
Petal.Length          6.9
Petal.Width           2.5
Species         virginica
dtype: object

In [95]:
def half(s):
    return s*0.5

In [99]:
iris[['Sepal.Length','Petal.Length']].apply(half)

     Sepal.Length  Petal.Length
0            2.55          0.70
1            2.45          0.70
2            2.35          0.65
3            2.30          0.75
4            2.50          0.70
..            ...           ...
145          3.35          2.60
146          3.15          2.50
147          3.25          2.60
148          3.10          2.70
149          2.95          2.55

[150 rows x 2 columns]

In [100]:
iris[['Sepal.Length','Petal.Length']]

     Sepal.Length  Petal.Length
0             5.1           1.4
1             4.9           1.4
2             4.7           1.3
3             4.6           1.5
4             5.0           1.4
..            ...           ...
145           6.7           5.2
146           6.3           5.0
147           6.5           5.2
148           6.2           5.4
149           5.9           5.1

[150 rows x 2 columns]

In [105]:
def double_make(s):
    return s*2

In [107]:
iris[['Sepal.Length','Petal.Length']].apply(double_make)

     Sepal.Length  Petal.Length
0            10.2           2.8
1             9.8           2.8
2             9.4           2.6
3             9.2           3.0
4            10.0           2.8
..            ...           ...
145          13.4          10.4
146          12.6          10.0
147          13.0          10.4
148          12.4          10.8
149          11.8          10.2

[150 rows x 2 columns]

In [109]:
iris['Species'].value_counts()

setosa        50
versicolor    50
virginica     50
Name: Species, dtype: int64

In [111]:
iris.sort_values(by='Sepal.Length')

     Sepal.Length  Sepal.Width  Petal.Length  Petal.Width    Species
13            4.3          3.0           1.1          0.1     setosa
42            4.4          3.2           1.3          0.2     setosa
38            4.4          3.0           1.3          0.2     setosa
8             4.4          2.9           1.4          0.2     setosa
41            4.5          2.3           1.3          0.3     setosa
..            ...          ...           ...          ...        ...
122           7.7          2.8           6.7          2.0  virginica
118           7.7          2.6           6.9          2.3  virginica
117           7.7          3.8           6.7          2.2  virginica
135           7.7          3.0           6.1          2.3  virginica
131           7.9          3.8           6.4          2.0  virginica

[150 rows x 5 columns]

In [114]:
df1.from_items

AttributeError: 'DataFrame' object has no attribute 'from_items'

In [115]:
df1.from_dict

In [117]:
iris.iloc[0:6,0:4]

   Sepal.Length  Sepal.Width  Petal.Length  Petal.Width
0           5.1          3.5           1.4          0.2
1           4.9          3.0           1.4          0.2
2           4.7          3.2           1.3          0.2
3           4.6          3.1           1.5          0.2
4           5.0          3.6           1.4          0.2
5           5.4          3.9           1.7          0.4

In [121]:
s1=pd.Series([1,2,3,4,5],index=['a','b','c','d','e'])
s1

a    1
b    2
c    3
d    4
e    5
dtype: int64